cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 100;

vertices
(
	(0 0 0)
	(.2 0 0)
	(.2 0 .001)
	(0 0 .001)
	(0 1 0)
	(.2 1 0)
	(.2 1 .001)
	(0 1 .001)
	(.6 0 0 )
	(.6 0 .001)
	(.6 1 0)
	(.6 1 .001)
	(.8 0 0)
	(.8 0 .001)
	(.8 1 0)
	(.8 1 .001)


);

blocks
(
    hex (0 1 5 4 3 2 6 7) (20 100 1) simpleGrading (1 1 1)
    hex (1 8 10 5 2 9 11 6) (40 100 1) simpleGrading (1 1 1)
    hex (8 12 14 10 9 13 15 11) (20 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

);

mergePatchPairs
(
);

// ************************************************************************* //
